{
    "document1": {
        "name": "Document 1",
        "content": "India's historic win against Australia in Gabba test left fans in awe. Rishabh Pant's heroics and Shubman Gill's fearless batting were the highlights."
    },
    "document2": {
        "name": "Document 2",
        "content": "Virat Kohli's aggressive captaincy steered India to victory against England, leveling the series 2-2. Rohit Sharma's century was pivotal."
    },
    "document3": {
        "name": "Document 3",
        "content": "Indian Premier League (IPL) witnessed an epic final as Chennai Super Kings defeated Mumbai Indians by a narrow margin."
    },
    "document4": {
        "name": "Document 4",
        "content": "India's bowling attack dominated New Zealand in the ICC World Test Championship final, clinching the title."
    },
    "document5": {
        "name": "Document 5",
        "content": "Mithali Raj became the leading run-scorer in women's cricket, setting a remarkable record for India."
    },
    "document6": {
        "name": "Document 6",
        "content": "Jasprit Bumrah's fiery spell dismantled the opposition in a crucial T20 match, helping India secure a series win."
    },
    "document7": {
        "name": "Document 7",
        "content": "Sachin Tendulkar's farewell match at Wankhede Stadium was an emotional moment for all cricket fans in India."
    },
    "document8": {
        "name": "Document 8",
        "content": "Harmanpreet Kaur's sensational knock in the Women's T20 World Cup semifinal guided India to the finals."
    },
    "document9": {
        "name": "Document 9",
        "content": "Yuvraj Singh's six consecutive sixes in a T20 World Cup match against England remains etched in cricket history."
    },
    "document10": {
        "name": "Document 10",
        "content": "Ravichandran Ashwin's spin wizardry bamboozled South Africa, leading India to a series victory."
    },
    "document11": {
        "name": "Document 11",
        "content": "Indian women's team displayed remarkable teamwork, winning the Asia Cup under Mithali Raj's captaincy."
    },
    "document12": {
        "name": "Document 12",
        "content": "Hardik Pandya's explosive batting and all-round performances have become a crucial asset for Team India."
    },
    "document13": {
        "name": "Document 13",
        "content": "Anil Kumble's perfect ten-wicket haul against Pakistan in 1999 is still celebrated as a historic achievement."
    },
    "document14": {
        "name": "Document 14",
        "content": "Smriti Mandhana's elegant strokeplay and consistent form make her one of India's brightest cricketing stars."
    },
    "document15": {
        "name": "Document 15",
        "content": "Kapil Dev's iconic innings in the 1983 World Cup final led India to its first-ever Cricket World Cup triumph."
    },
    "document16": {
        "name": "Document 16",
        "content": "Rahul Dravid's resilience and technique earned him the nickname 'The Wall' in Test cricket."
    },
    "document17": {
        "name": "Document 17",
        "content": "Poonam Yadav's brilliant leg-spin bowling has made her one of the top-ranked bowlers in women's cricket."
    },
    "document18": {
        "name": "Document 18",
        "content": "K. L. Rahul's consistency with the bat has solidified his position as India's premier opening batsman."
    },
    "document19": {
        "name": "Document 19",
        "content": "The rivalry between India and Pakistan in cricket remains one of the most intense and eagerly awaited contests."
    },
    "document20": {
        "name": "Document 20",
        "content": "Jhulan Goswami's remarkable pace and swing bowling have made her an inspiration for aspiring cricketers."
    },
    "document21": {
        "name": "Document 21",
        "content": "Suresh Raina's explosive batting and brilliant fielding have been pivotal for India in limited-overs cricket."
    },
    "document22": {
        "name": "Document 22",
        "content": "India's under-19 cricket team displayed exceptional talent, winning the World Cup on multiple occasions."
    },
    "document23": {
        "name": "Document 23",
        "content": "Rohit Sharma's double centuries in ODIs have cemented his place as one of India's greatest batsmen."
    },
    "document24": {
        "name": "Document 24",
        "content": "P. V. Sindhu's passion for cricket was evident from an early age, but she chose to pursue badminton and became an Olympic champion."
    },
    "document25": {
        "name": "Document 25",
        "content": "Kuldeep Yadav's unorthodox left-arm spin has troubled many batsmen, earning him accolades in international cricket."
    },
    "document26": {
        "name": "Document 26",
        "content": "M. S. Dhoni's captaincy and finishing prowess have made him a legendary figure in Indian cricket history."
    },
    "document27": {
        "name": "Document 27",
        "content": "Pujara's marathon innings in Test cricket often lays the foundation for India's victories."
    },
    "document28": {
        "name": "Document 28",
        "content": "Shikhar Dhawan's aggressive batting at the top of the order has provided India with crucial starts in limited-overs cricket."
    },
    "document29": {
        "name": "Document 29",
        "content": "Ravindra Jadeja's all-round abilities have made him an indispensable asset for the Indian cricket team."
    },
    "document30": {
        "name": "Document 30",
        "content": "Indian cricket's success owes much to its domestic cricket structure, producing a pool of talented players."
    },
    "document31": {
        "name": "Document 31",
        "content": "V. V. S. Laxman's legendary innings against Australia in the 2001 Kolkata Test will forever be etched in cricketing folklore."
    },
    "document32": {
        "name": "Document 32",
        "content": "Mithali Raj's consistency with the bat has made her the backbone of the Indian women's cricket team."
    },
    "document33": {
        "name": "Document 33",
        "content": "Ishant Sharma's emergence as a leader of India's pace attack has been commendable."
    },
    "document34": {
        "name": "Document 34",
        "content": "Harmapreet Kaur's blistering knock of 171 runs against Australia in the 2017 Women's World Cup was iconic."
    },
    "document35": {
        "name": "Document 35",
        "content": "Bhuvneshwar Kumar's swing bowling has been a vital weapon for India, especially in overseas conditions."
    },
    "document36": {
        "name": "Document 36",
        "content": "The rise of young talents like Shubman Gill and Prithvi Shaw brings a promising future for Indian cricket."
    },
    "document37": {
        "name": "Document 37",
        "content": "Anjum Chopra's achievements in women's cricket have paved the way for future generations of female cricketers in India."
    },
    "document38": {
        "name": "Document 38",
        "content": "Yuzvendra Chahal's leg-spin bowling has been a potent weapon for India in white-ball cricket."
    },
    "document39": {
        "name": "Document 39",
        "content": "India's famous win against West Indies in the 1983 World Cup semifinal marked a turning point in Indian cricket history."
    },
    "document40": {
        "name": "Document 40",
        "content": "Rohit Sharma's record-breaking three double centuries in ODIs have made him an ODI batting powerhouse."
    },
    "document41": {
        "name": "Document 41",
        "content": "Sourav Ganguly's aggressive captaincy laid the foundation for India's success in the early 2000s."
    },
    "document42": {
        "name": "Document 42",
        "content": "Javagal Srinath's fiery fast bowling made him one of India's most feared pacers during the 90s."
    },
    "document43": {
        "name": "Document 43",
        "content": "India's remarkable run-chase against Sri Lanka in the 2011 World Cup final led to the nation's second World Cup victory."
    },
    "document44": {
        "name": "Document 44",
        "content": "Mithali Raj's technique and temperament make her one of the most consistent batswomen in women's cricket."
    },
    "document45": {
        "name": "Document 45",
        "content": "Rishabh Pant's aggressive batting and exceptional wicket-keeping skills have earned him accolades."
    },
    "document46": {
        "name": "Document 46",
        "content": "Sunil Gavaskar's impeccable technique and batting prowess laid the foundation for Indian cricket's growth."
    },
    "document47": {
        "name": "Document 47",
        "content": "Deepti Sharma's all-round performances have made her a key player for India in women's cricket."
    },
    "document48": {
        "name": "Document 48",
        "content": "India's dominant performance in the 2007 T20 World Cup, culminating in a final win against Pakistan, sparked the T20 revolution."
    },
    "document49": {
        "name": "Document 49",
        "content": "R. Ashwin's variations and accuracy in spin bowling have troubled the best batsmen in the world."
    },
    "document50": {
        "name": "Document 50",
        "content": "Sachin Tendulkar's record-breaking centuries and masterful strokes earned him the title 'God of Cricket'."
    }
}